#include "Character.h"

void word()
{
	cout << endl << "VR                          - Виртуальная реальность." << endl << "VR гарнитура                - это устройство, которое надевается на голову и отображает различный контент, который ощущаеться как реальный." << endl;
	cout << "Автономность                - это режим устройства. Данный режим позволяет программному обеспечению и устройству работать без зависимости. В данном случае работать без интернета." << endl;
	cout << "Ресурсы                     - характеристики устройства, от которых зависит работа программного обеспечения." << endl;
	cout << "Тяжёлые игры                - это ресурсопотребные игры." << endl;
	cout << "Стандартный пользователь    - обычный пользователь, поверхостно разбирается в гаджетах." << endl;
	cout << "Опытный пользователь        - это продвинутый пользователь, который углублённо разбирается в гаджетах." << endl;
	cout << "Компилировать               - это слово применяется программистами. Это слово означает проверку кода на работоспособность." << endl;
	cout << "Постоянная память           - это память, на которой хранятся данные." << endl;
	cout << "Оперативная память          - это память, используемая программным обеспечением при работе компьютера. Хранить на ней ничего нельзя." << endl;
	cout << "Операционная система        - это программное обеспечение, которое заставляет устройство работать." << endl;
	cout << "SSD                         - тип постоянной памяти. Твёрдотельный накопитель." << endl;
	cout << "HDD                         - тип постоянной памяти. Жёсткий диск." << endl;
	cout << "DDR3/DDR4 и другие вариации - это тип оперативной памяти. Чем выше цифра типа, тем оперативная память быстрее." << endl;
	cout << "x86, x64                    - разрядность процессоров. Чаще их используют в компьютерах и ноутбуках. x64 имеет 64-битную разрядность, а x86 имеет 32-битную разрядность." << endl;
	cout << "ARMx86, ARMx64              - разрядности процессоров. ARM процессоры предназначены для мобильных устройств и занимают меньше места в устройстве за счёт низкой производительности по сравнению с x64 и x86 процессорами." << endl;
	cout << "PC                          - стационарный компьютер." << endl << endl << endl << endl;
}